app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE (isbn='') LIMIT 1
---
  def create

    isbn = params[:book][:isbn]

    @book = Book.find_by_isbn(isbn)

SELECT `tags`.* FROM `tags` WHERE `tags`.`name` = '心理学' LIMIT 1
---
  def tag

    @tag = Tag.where(:name=>params[:id]).first