app/controllers/profile_controller.rb

  def show

    @user = User.find(params[:id])

    @RequestMyBooks=UserBookRequest.joins(:user_book, ' and user_books.user_id='+@user.id.to_s).joins(:request_user)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` INNER JOIN `user_books` ON `books`.`id` = `user_books`.`book_id` WHERE `user_books`.`user_id` = 1