app/views/profile/show.html.erb

	  i = 0
	  @user.books.each do |book|
---
SELECT `books`.* FROM `books` INNER JOIN `user_books` ON `books`.`id` = `user_books`.`book_id` WHERE `user_books`.`user_id` = 1